In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
data = [4, 8, 15, 16, 23, 42]
ser = pd.Series(data)
print(ser)
type(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import random

In [4]:
random_list = []
for i in range(10):
    a = random.randint(1,11)
    random_list.append(a)
ser = pd.Series(random_list)
print(ser)

0     8
1    10
2     4
3    11
4     8
5     3
6     8
7    11
8     9
9     6
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [5]:
df = {'Name': ['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
pd.DataFrame(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

A Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.).

In [6]:
df = pd.DataFrame({'Name': ['Alice','Bob','Claire'],'Age':[25,30,27]})
df

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [7]:
s = pd.Series([1, 3, 5, 6, 8])
print(s)

0    1
1    3
2    5
3    6
4    8
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

In [8]:
df.head(1)

    Name  Age
0  Alice   25

Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.

In [9]:
df.shape

(3, 2)

Summary of Statistics of DataFrame using describe() method.

In [10]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

In [11]:
df.dropna()

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

Sorting the DataFrame using sort_values() method.

In [12]:
df.sort_values(by=['Age'], ascending=True)

     Name  Age
0   Alice   25
2  Claire   27
1     Bob   30

Pandas tail() method is used to return bottom n (5 by default) rows of a data frame or series.

In [13]:
df.tail(1)

     Name  Age
2  Claire   27

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In the Pandas library, all data structures are value mutable, meaning that the values they contain can be changed. However, not all data structures are size mutable, meaning that their size or shape can be changed. Among the three data structures you mentioned - Series, DataFrame, and Panel - Series is size immutable while DataFrame and Panel are both size mutable. This means that you can add or remove elements from a DataFrame or Panel, but not from a Series.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
 
auth_series = pd.Series(author)
article_series = pd.Series(article)
 
df = {'Author': auth_series,
         'Article': article_series} 
pd.DataFrame(df)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178